{
  "Environmental": {
    "Waste Management & Recycling": "Covers all issues related to refuse collection, including bin schedules, recycling protocols, and complaints regarding fly-tipping or illegal dumping.",
    "Local Government Maintenance": "Focuses on the operational performance of local authorities regarding the upkeep of public infrastructures, parks, and transparency in communicating service disruptions.",
    "Urban Planning & Green Spaces": "Pertains to land-use decisions, including housing developments on greenbelts, urban aesthetics, and the preservation of natural landscapes.",
    "Water Management & Pollution": "Addresses hydrological issues such as flood control, drainage failure, sewage spills, and general water quality or contamination concerns.",
    "Biodiversity & Animal Welfare": "Concerns the protection of wildlife habitats, biodiversity loss, and the responsible treatment of domestic and wild animals.",
    "Activism & Community Action": "Encompasses civic engagement related to the environment, including protests, petitions, and grassroots volunteer initiatives.",
    "Sustainable Transport & Energy": "Focuses on green infrastructure, including low-emission zones, renewable energy projects, and electric vehicle facilities.",
    "Climate Discourse & Policy": "Captures debates surrounding climate change validity, the economic impact of green policies, and skepticism of environmental narratives.",
    "Nuisance & Environmental Health": "Relates to sensory pollution, including excessive noise, fireworks, hazardous odors, and air quality issues affecting public health.",
    "Other Environmental": "Any environmental concern not covered by the above categories."
  },
  "Immigration": {
    "Anti-Immigrant Sentiment": "Includes hostile rhetoric, hate speech, scapegoating, and exclusionary demands directed at immigrants or refugees.",
    "Policy & Political Critique": "Focuses on government handling of borders, partisan debates, and criticism of political or media narratives regarding migration.",
    "Socio-Economic Impact": "Addresses the perceived or actual effects of immigration on housing, public services, the job market, and local community demographics.",
    "Legal & Administrative Status": "Covers the procedural aspects of immigration, including asylum claims, visa documentation, and the legal distinctions between migrant statuses.",
    "Humanitarian & Integration": "Reflects supportive perspectives, including empathy for refugees, advocacy for legal migration pathways, and the celebration of cultural diversity.",
    "Identity & Terminology": "Discussions centered on the definition of immigration terms, national identity, and the historical context of migration.",
    "Other Immigration": "Any immigration-related issue not covered by the above categories."
  },
  "Housing": {
    "Affordability & Market Economics": "Concerns the financial aspects of housing, including rent levels, mortgage rates, property prices, and economic policies affecting the market.",
    "Planning & Land Use": "Focuses on the regulatory process of development, including council permissions, greenbelt usage, and the environmental footprint of new builds.",
    "Tenancy & Landlord Relations": "Covers the rental experience, including repair disputes, eviction concerns, lease agreements, and landlord conduct.",
    "Homelessness & Welfare": "Addresses housing insecurity, emergency accommodation, rough sleeping, and social support for those without stable shelter.",
    "Heritage & Preservation": "Relates to the protection of historic buildings, local landmarks, and the emotional connection to established architectural character.",
    "Construction Standards": "Focuses on the physical quality of housing, including safety hazards, workmanship defects, and maintenance delays in new or existing stock.",
    "Development Motives & Design": "Critiques the aesthetic quality of new developments and the perceived prioritization of profit over community needs.",
    "Political Accountability": "Directs blame or requests for action toward local councils and politicians regarding housing promises and policy failures.",
    "Fraud & Malpractice": "Captures unethical behavior, including rental scams, fake listings, and dishonest practices by agents or developers.",
    "Infrastructure Impact": "Discusses the strain placed on local amenities, transport, and services by increased housing density.",
    "Other Housing": "Any housing issue not covered by the above categories."
  },
  "Democracy": {
    "Voter Participation": "Focuses on the act of voting, including turnout encouragement, voter apathy, and skepticism about the value of the individual vote.",
    "Leadership & Party Critique": "Targets the performance, integrity, and accountability of specific politicians, parties, and the broader political establishment.",
    "Electoral Integrity": "Concerns the mechanics of elections, including transparency, procedural fairness, and the administration of polling.",
    "Local Representation": "Addresses the effectiveness of local governance, council service delivery, and the fairness of electoral boundaries.",
    "Systemic Reform": "Advocates for major changes to the political system, including anti-establishment sentiments and calls to overhaul institutions.",
    "Campaigns & Media": "Critiques political messaging, campaigning tactics, media bias, and the manipulation of public discourse.",
    "Democratic Values": "Reflects on the principles of democracy, rights, and the gap between democratic ideals and institutional reality.",
    "Other Democracy": "Any democracy-related issue not covered by the above categories."
  },
  "Economy": {
    "Cost of Living Pressures": "Focuses on the impact of inflation on households, including rising utility bills, food costs, and unavoidable daily expenses.",
    "Retail & High Street": "Concerns the health of local commerce, including shop closures, the shift to online retail, and high street revitalization.",
    "Fiscal Policy & Corporate Conduct": "Critiques tax policies, government spending debts, and corporate profit-seeking behaviors.",
    "Employment & Labor": "Addresses the job market, wage levels, contract security, and working conditions.",
    "Banking & Cash Access": "Focuses on the availability of financial services, including branch closures and the transition to digital payments.",
    "Economic Infrastructure": "Relates to physical developments that drive economy, such as transport hubs, commercial property, and urban renewal.",
    "Consumer Protection": "Covers financial scams, hidden fees, exploitative pricing, and unethical business practices.",
    "Other Economy": "Any economic issue not covered by the above categories."
  },
  "Cost of living": {
    "Housing & Shelter Costs": "Specific to the rising costs of rent, property ownership, and council tax relative to affordability.",
    "Utilities & Energy Bills": "Focuses on gas, electricity, and water charges, including supplier disputes and metering issues.",
    "Food & Grocery Inflation": "Concerns the price of consumables, shrinkflation, and discrepancies in retail pricing.",
    "Transport Expenses": "Covers the costs associated with travel, including fuel prices, parking fees, and public transport fares.",
    "Public Fees & Levies": "Addresses government-imposed costs, such as service charges, fines, and the impact of austerity on personal finances.",
    "Welfare & Aid": "Focuses on the reliance on benefits, food banks, and charity to survive financial hardship.",
    "Payment Barriers": "Relates to the financial friction caused by cashless mandates, transaction fees, and digital payment failures.",
    "Income Disparity": "Contrasts stagnant wages or income against the rising cost of essential goods and services.",
    "Health & Care Costs": "Covers out-of-pocket expenses for medical, dental, and veterinary services.",
    "Consumer Value": "Critiques the declining quality of goods and services in relation to their increasing prices.",
    "Other Cost of Living": "Any cost of living issue not covered by the above categories."
  },
  "Public services": {
    "Waste & Sanitation": "Focuses on the reliability of bin collections, recycling facilities, and street cleaning services.",
    "Roads & Infrastructure": "Concerns the physical maintenance of roads, lighting, drainage, and signage.",
    "Medical Services": "Addresses the availability and quality of NHS, GP, hospital, and emergency care.",
    "Postal & Delivery": "Relates to the reliability of mail services and parcel delivery networks.",
    "Transport & Transit": "Focuses on the operation of public buses, trains, and parking enforcement.",
    "Council Governance": "Critiques the responsiveness, communication, and administrative competence of local authorities.",
    "Public Amenities": "Concerns the accessibility and condition of libraries, parks, leisure centers, and communal spaces.",
    "Funding & Policy": "Addresses the impact of budget cuts, taxation, and political decisions on service quality.",
    "Banking Access": "Focuses on the availability of face-to-face financial services and cash access points.",
    "Utility Reliability": "Covers interruptions or failures in essential water, energy, and broadband supplies.",
    "Safety & Policing": "Relates to the effectiveness of law enforcement and emergency response services.",
    "Digital Access": "Critiques the usability and accessibility of online government portals and service apps.",
    "Social Care": "Focuses on support services for the elderly, disabled, and vulnerable populations.",
    "Other Public Services": "Any public service issue not covered by the above categories."
  },
  "Crime": {
    "Property Offenses": "Includes burglary, theft, vehicle break-ins, vandalism, and criminal damage to property.",
    "Violent Crime": "Covers physical assaults, weapon use, and aggressive acts resulting in bodily harm.",
    "Fraud & Deception": "Relates to scams, identity theft, and financial trickery, both online and offline.",
    "Policing & Response": "Critiques the speed, effectiveness, and visibility of law enforcement.",
    "Anti-Social Behavior": "Focuses on public disorder, youth loitering, intimidation, and drug-related nuisance.",
    "Animal Cruelty": "Concerns abuse, neglect, or violent acts involving animals.",
    "Road & Traffic Offenses": "Addresses illegal parking, reckless driving, and vehicle-related misconduct without direct violence.",
    "Moral Condemnation": "Expressions of outrage and judgment directed at criminals or specific acts.",
    "Systemic Causes": "Links crime to broader political failures, social inequality, or lack of resources.",
    "Victim Support": "Focuses on justice, empathy, and solidarity with those affected by criminal acts.",
    "Other Crime": "Any crime-related issue not covered by the above categories."
  },
  "Businesses": {
    "Consumer Feedback": "General reviews of businesses, covering satisfaction with service, quality, or ambiance.",
    "Pricing & Payments": "Focuses on cost-related complaints, value for money, and payment method issues.",
    "Business Dynamics": "Observations on business openings, closures, rebranding, and operational changes.",
    "Local Identity": "Relates to the support of independent shops, heritage businesses, and community character.",
    "Trust & Integrity": "Warnings about scams, poor workmanship, and dishonest trading practices.",
    "Employment & Promotion": "Covers job vacancies, recruitment, and business self-advertising.",
    "Access & Infrastructure": "Concerns external factors affecting businesses, such as parking, traffic, and fuel availability.",
    "Automation & Tech": "Critiques the use of self-service kiosks, apps, and reduced human interaction in commerce.",
    "Other Businesses": "Any business-related issue not covered by the above categories."
  },
  "Technology": {
    "Connectivity": "Focuses on broadband speeds, mobile network signal, and internet reliability.",
    "Digital Payments": "Addresses the shift to cashless systems, digital wallets, and transaction friction.",
    "Automation": "Concerns the replacement of human staff with kiosks, AI, and self-service technologies.",
    "Smart Devices": "Relates to the functionality and reliability of IoT, smart meters, and home security tech.",
    "Surveillance": "Debates the use of CCTV, facial recognition, drones, and privacy implications.",
    "Future Mobility": "Focuses on electric vehicles, autonomous driving, and delivery robots.",
    "User Experience": "Critiques the design, glitches, and usability of apps and digital platforms.",
    "Cybersecurity": "Concerns online safety, hacking, data breaches, and digital fraud protection.",
    "Adoption & Resistance": "Reflects on the social impact of rapid tech change, including nostalgia for analog methods.",
    "Online Discourse": "Focuses on social media behavior, censorship, and the spread of misinformation.",
    "Other Technology": "Any technology-related issue not covered by the above categories."
  },
  "Cultural issues": {
    "Heritage & Memory": "Reflections on local history, nostalgia, and the preservation of the past.",
    "Diversity & Inclusion": "Discussions on race, religion, gender, and the politics of identity and representation.",
    "Urban Transformation": "Debates the impact of modernization and development on community character.",
    "National Identity": "Focuses on symbols, flags, patriotism, and media narratives about the nation.",
    "Civic Engagement": "Relates to political involvement, community decision-making, and public policy debate.",
    "Discourse Tone": "Captures the style of cultural debate, including humor, satire, and incivility.",
    "Art & Aesthetics": "Evaluations of public art, graffiti, and the visual culture of the environment.",
    "Social & Entertainment": "Concerns the cultural value of venues, festivals, nightlife, and social hubs.",
    "Public Behavior": "Addresses etiquette, safety, and social norms in shared community spaces.",
    "Other Cultural Issues": "Any cultural issue not covered by the above categories."
  },
  "Education": {
    "School Experience": "Personal accounts of school life, teacher quality, and academic satisfaction.",
    "Governance & Policy": "Critiques funding, curriculum, political decisions, and administrative rules.",
    "Special Needs Support": "Focuses on provisions and challenges for students with SEN and EHCP requirements.",
    "Safety & Facilities": "Concerns the physical condition of schools and safety during the school run.",
    "Family Engagement": "Relates to parental involvement, homeschooling, and communication with schools.",
    "Extracurriculars": "Covers non-academic activities, clubs, sports, and teacher appreciation.",
    "Vocational & Adult Learning": "Focuses on apprenticeships, career training, and continuing education.",
    "Community Context": "Addresses how local planning and housing affect school capacity and access.",
    "Other Education": "Any education-related issue not covered by the above categories."
  },
  "Transport": {
    "Road Maintenance": "Concerns the physical state of road surfaces, drainage, and signage.",
    "Public Transit Services": "Focuses on the reliability, cost, and availability of buses, trains, and aviation.",
    "Road Safety & Behavior": "Addresses driving standards, speeding, and the safety of vulnerable road users.",
    "Policy & Governance": "Critiques transport funding, planning, regulations, and political decision-making.",
    "Green & Future Transport": "Relates to cycling infrastructure, electric vehicle charging, and sustainable mobility.",
    "Other Transport": "Any transport-related issue not covered by the above categories."
  },
  "Health": {
    "Access to Care": "Focuses on waiting times, appointment availability, and access to GPs or hospitals.",
    "Pharmacy & Dental": "Concerns the specific availability and cost of dental care and medication.",
    "Systemic Policy": "Critiques government funding, privatization, and management of the health service.",
    "Mental Wellbeing": "Addresses mental health struggles, support services, and community care.",
    "Preventive Health": "Relates to lifestyle advice, screenings, vaccinations, and public health campaigns.",
    "Vulnerable Groups": "Focuses on the specific health needs of the elderly, children, and disabled people.",
    "Veterinary Care": "Concerns the health, treatment costs, and welfare of pets.",
    "Other Health": "Any health-related issue not covered by the above categories."
  },
  "Childcare and family": {
    "Early Years Care": "Focuses on nurseries, childminders, breastfeeding support, and school entry.",
    "Parenting Challenges": "Relates to work-life balance, social judgment, and the struggles of raising children.",
    "Child Health": "Concerns access to pediatric medical care and diagnosis of developmental issues.",
    "Safety in Public": "Addresses road safety, stranger danger, and bullying risks for children.",
    "Support Networks": "Focuses on government aid, charities, and community groups helping families.",
    "Family Dynamics": "Reflects on relationships, domestic challenges, and family traditions.",
    "Other Childcare & Family": "Any childcare or family-related issue not covered by the above categories."
  },
  "Tax": {
    "Local & Waste Tax": "Critiques council tax rates and additional fees for local services like waste collection.",
    "Vehicle & Road Tax": "Focuses on car taxation, MOT compliance, and parking enforcement revenues.",
    "Administration": "Concerns interactions with tax authorities, including refunds, probate, and system errors.",
    "Policy & Fairness": "Debates the equity of the tax system, government spending, and political promises.",
    "Compliance & Evasion": "Addresses tax avoidance, fraud, and the ethics of financial contribution.",
    "Economic Burden": "Relates taxation levels to the broader cost of living crisis and financial stress.",
    "Satire & Humor": "Captures ironic or humorous commentary regarding tax obligations.",
    "Other Tax": "Any tax-related issue not covered by the above categories."
  },
  "Pensions": {
    "Policy & Rules": "Focuses on retirement age, eligibility criteria, and tax implications for pensioners.",
    "Administration": "Concerns payment delays, errors, and the accessibility of pension services.",
    "Economic Reality": "Addresses the adequacy of pension income relative to inflation and living costs.",
    "Political Context": "Critiques the use of pensioners in political rhetoric and voting strategies.",
    "Social Aspects": "Relates to retirement lifestyle, community support, and age-related concessions.",
    "Inequality": "Debates the wealth gap between generations and different types of pension schemes.",
    "Fraud Risks": "Warnings about scams specifically targeting pension funds and retirees.",
    "Other Pensions": "Any pension-related issue not covered by the above categories."
  },
  "Benefits": {
    "Stigma & Perception": "Addresses social attitudes, fraud accusations, and moral judgments of recipients.",
    "System & Process": "Concerns the bureaucracy of applying for benefits, including delays and errors.",
    "Advice & Eligibility": "Provides guidance on navigating the welfare system and accessing entitlements.",
    "Policy & Politics": "Critiques government management of the welfare state and social safety nets.",
    "Charity & Aid": "Focuses on food banks and community initiatives supplementing state support.",
    "Economic Hardship": "Relates benefit levels to the reality of poverty and the cost of living.",
    "Lived Experience": "Personal narratives of the emotional and practical impact of relying on benefits.",
    "Other Benefits": "Any benefits-related issue not covered by the above categories."
  },
  "Foreign issues": {
    "Conflict & War": "Focuses on active international conflicts, humanitarian crises, and military actions.",
    "Aid & Spending": "Debates the allocation of funds to foreign aid versus domestic needs.",
    "Nationalism & Identity": "Reflects on domestic prioritization, xenophobia, and national interests.",
    "Diplomacy & Leadership": "Critiques government foreign policy, international relations, and leadership.",
    "History & Context": "Draws parallels between current events and historical or colonial precedents.",
    "Media & Narrative": "Critiques the framing, bias, and accuracy of international news coverage.",
    "Military Developments": "Observations on military hardware, exercises, and future conflict speculation.",
    "Global Solidarity": "Expressions of support for international communities and diaspora identities.",
    "Other Foreign Issues": "Any foreign issue not covered by the above categories."
  },
  "Non-specific": {"Non-specific": "Not enough information to choose a category"}
}
